In [3]:
from pandas import Series, DataFrame, Index, MultiIndex
import pandas as pd
import numpy as np

## 合并数据集

* pandas.merge 可以根据一个或者多个键将不同的DataFrame中的行链接起来
* pandas.concat 可以沿着一条轴将多个对象堆叠在一起
* 实例方法combin_first可以将重复数据编结在一起，用一个对象的值填充另一个对象的值

### 数据库风格的DataFrame合并

In [4]:
df1 = DataFrame({"key": ["b", "b", "a", "c", "a", "a", "b"], "data1": range(7)})

In [5]:
df2 = DataFrame({"key": ["a", "b", "d"], "data2": range(3)})

In [6]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [7]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

这是一种多对一的合并

In [8]:
pd.merge(df1, df2)

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

我们没有指明要用哪个列进行连接。如果没有指定，merge就会将重叠列的列明当做键。

不过最好显示的指定一下：

In [9]:
pd.merge(df1, df2, on="key")

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

如果两个对象的列名不同，也可以进行指定

In [10]:
df3 = DataFrame({"1key": ["b", "b", "a", "c", "a", "a", "b"], "data1": range(7)})

In [11]:
df4 = DataFrame({"rkey": ["a", "b", "d"], "data2": range(3)})

In [12]:
pd.merge(df3, df4, left_on="1key", right_on="rkey")

  1key  data1  data2 rkey
0    b      0      1    b
1    b      1      1    b
2    b      6      1    b
3    a      2      0    a
4    a      4      0    a
5    a      5      0    a

默认情况下，merge做的是 inner 连接，结果中的键是交集。

其他方式还有"left"、"right"以及"outer"

外连接取的是键的并集，组合了左连接和右连接的结果

In [13]:
pd.merge(df1, df2, how="outer")

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

多对多的合并一样很简单，无线额外工作。

In [14]:
df1 = DataFrame({"key": ['b', 'b', 'a', 'c', 'a', 'b'], "data1": range(6)})

In [15]:
df2 = DataFrame({"key": ["a", "b", "a", "b", "d"], "data2": range(5)})

In [16]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [17]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [18]:
pd.merge(df1, df2, on="key", how="left")

    data1 key  data2
0       0   b    1.0
1       0   b    3.0
2       1   b    1.0
3       1   b    3.0
4       2   a    0.0
5       2   a    2.0
6       3   c    NaN
7       4   a    0.0
8       4   a    2.0
9       5   b    1.0
10      5   b    3.0

多对多连接产生的是行的笛卡尔积

df1 有3个b行，右边df2有两个b，所以最终结果有6个b

连接方式只影响出现在结果中的键

In [19]:
pd.merge(df1, df2, how="inner")

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

要根据多个键进行合并，传入一个由列名组成的列表即可

In [20]:
left = DataFrame({
    "key1": ["foo", "foo", "bar"],
    "key2": ["one", "two", "one"],
    "lval": [1,2,3]
})

In [21]:
right = DataFrame({
    "key1": ["foo", "foo", "bar", "bar"],
    "key2": ["one", "one", "one", "two"],
    "rval": [4,5,6,7,]
})

In [22]:
pd.merge(left, right, on=["key1", "key2"], how="outer")

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

结果中出现哪些键组合取决于合并方式。

可以这么理解：多个键形成一系列元组，并将其当做单个连接键。

对于重复列的处理，merge会有个suffixes选项，用于指定附加到左右两个DataFrame对象的重叠列名的字符串

In [23]:
pd.merge(left, right, on="key1")

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [24]:
pd.merge(left, right, on="key1", suffixes=("_left", "_right"))

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

### 索引上的合并

有时候，DataFrame的链接键位于索引上。

可以传入left_index=True或者right_index=True 或者两个都传

In [25]:
left1 = DataFrame({
    "key": ["a", "b", "a", "a", "b", "c"],
    "value": range(6)
})

In [26]:
right1 = DataFrame({"group_val": [3.5, 7]}, index=["a", "b"])

In [27]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [28]:
right1

   group_val
a        3.5
b        7.0

In [29]:
pd.merge(left1, right1, left_on="key", right_index=True)

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

对于层次索引，就有点复杂了

In [30]:
lefth = DataFrame({
    "key1": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada"],
    "key2": [2000, 2001, 2002, 2001, 2002],
    "data": np.arange(5.)
})

In [31]:
righth = DataFrame(np.arange(12).reshape((6,2)),
                  index=[["Nevada", "Nevada", "Ohio", "Ohio","Ohio", "Ohio"],
                        [2001, 2000, 2000, 2000, 20001, 20002]],
                  columns=["event1", "event2"])

In [32]:
lefth

   data    key1  key2
0   0.0    Ohio  2000
1   1.0    Ohio  2001
2   2.0    Ohio  2002
3   3.0  Nevada  2001
4   4.0  Nevada  2002

In [33]:
righth

              event1  event2
Nevada 2001        0       1
       2000        2       3
Ohio   2000        4       5
       2000        6       7
       20001       8       9
       20002      10      11

这种情况下，必须以列表的形式指明用做合并键的多个列

In [34]:
pd.merge(lefth, righth, left_on=["key1", "key2"], right_index=True)

   data    key1  key2  event1  event2
0   0.0    Ohio  2000       4       5
0   0.0    Ohio  2000       6       7
3   3.0  Nevada  2001       0       1

In [35]:
pd.merge(lefth, righth, left_on=["key1", "key2"], right_index=True, how="outer")

   data    key1   key2  event1  event2
0   0.0    Ohio   2000     4.0     5.0
0   0.0    Ohio   2000     6.0     7.0
1   1.0    Ohio   2001     NaN     NaN
2   2.0    Ohio   2002     NaN     NaN
3   3.0  Nevada   2001     0.0     1.0
4   4.0  Nevada   2002     NaN     NaN
4   NaN  Nevada   2000     2.0     3.0
4   NaN    Ohio  20001     8.0     9.0
4   NaN    Ohio  20002    10.0    11.0

也可以同时使用双方的索引

In [36]:
left2 = DataFrame(np.arange(1,7).reshape((3,2)),
                 index=["a", "c", "e"],
                 columns=["Ohio", "Nevada"])

In [37]:
right2 = DataFrame(np.arange(7,15).reshape((4,2)),
                 index=["b", "c", "d", "e"],
                 columns=["Missouri", "Alabama"])

In [38]:
left2

   Ohio  Nevada
a     1       2
c     3       4
e     5       6

In [39]:
right2

   Missouri  Alabama
b         7        8
c         9       10
d        11       12
e        13       14

In [40]:
pd.merge(left2, right2, how="outer", left_index=True, right_index=True)

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

DataFrame还有个join实例方法，能够方便的实现按索引合并。

In [41]:
left2.join(right2, how="outer")

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

join方法默认是左连接

还支持索引 跟调动者 的某个列进行连接

对于简单的索引合并，还可以向join传入一组DataFrame

In [42]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [43]:
right1

   group_val
a        3.5
b        7.0

In [44]:
left1.join(right1, on="key")

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [45]:
another = DataFrame([[7,8],[9,10],[11,12],[16,17]], index=["a", "c", "e", "f"], columns=["New York", "Oregon"])

In [46]:
left2.join([right2, another])

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a     1       2       NaN      NaN         7       8
c     3       4       9.0     10.0         9      10
e     5       6      13.0     14.0        11      12

### 轴向连接

还有一种合并运算称为连接（concatenation）、绑定(binding)、堆叠(stacking)

In [47]:
arr = np.arange(12).reshape((3,4))

In [48]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [49]:
np.concatenate([arr, arr], axis=1)

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

pandas的concat函数提供连接方式

三个没有重叠索引的Series

In [50]:
s1 = Series([0,1], index=["a", "b"])

In [51]:
s2 = Series([2,3,4], index=["c", "d", "e"])

In [52]:
s3 = Series([5,6], index=["f", "g"])

In [53]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

默认情况下，concat是在axis=0上工作的，最终产生一个新的Series

如果传入axis=1 则结果变为一个DataFrame

In [54]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

这种情况下，另一轴没有重叠。传入join="inner"即可得到他们的并集

In [55]:
s4 = pd.concat([s1*5, s3]);s4

a    0
b    5
f    5
g    6
dtype: int64

In [56]:
pd.concat([s1, s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [57]:
pd.concat([s1, s4], axis=1, join="inner")

   0  1
a  0  0
b  1  5

你可以通过join_axes指定要在其他轴上使用的索引

In [58]:
pd.concat([s1, s4], axis=1, join_axes=[["a", "c", "b", "e"]])

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  5.0
e  NaN  NaN

想要不参与连接的片段在结果中区分开，可以在连接轴上创建一个层次索引

In [59]:
result = pd.concat([s1,s2,s3], keys=["one", "two", "three"]);result

one    a    0
       b    1
two    c    2
       d    3
       e    4
three  f    5
       g    6
dtype: int64

如果沿着axis=1对series合并，则keys就会变为DataFrame的列头

In [60]:
pd.concat([s1,s2,s3], axis=1, keys=["one", "two", "three"])

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

同样的逻辑对DataFrame对象也一样

In [61]:
df1 = DataFrame(np.arange(6).reshape((3,2)), index=["a", "b", "c"], columns=["one", "two"])

In [62]:
df2 = DataFrame(5+np.arange(4).reshape((2,2)), index=["a", "c"], columns=["three", "four"])

In [63]:
pd.concat([df1, df2], axis=1, keys=["leve1", "leve2"])

  leve1     leve2
    one two three four
a     0   1   5.0  6.0
b     2   3   NaN  NaN
c     4   5   7.0  8.0

In [64]:
pd.concat([df1, df2])

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN

如果传入的是一个字典，则字典的键会被当做keys选项值

In [65]:
pd.concat({"level1": df1, "level2":df2}, axis=1)

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

还有个问题，就是跟当前分析工作无关的DataFrame行索引。

只有传递ignore_index=True即可

In [66]:
df1 = DataFrame(np.random.randn(3,4), columns=list("abcd"))

In [67]:
df2 = DataFrame(np.random.randn(2,3), columns=list("bda"))

In [68]:
df1

          a         b         c         d
0 -0.381166  0.854895 -1.916495 -0.330340
1 -0.249483 -0.528534  1.672201 -1.307664
2  2.504183  0.659567 -1.050165 -1.206636

In [69]:
df2

          b         d         a
0  0.030773 -1.063719  2.713183
1  0.403601 -1.242394  0.885463

In [70]:
pd.concat([df1, df2], ignore_index=True)

          a         b         c         d
0 -0.381166  0.854895 -1.916495 -0.330340
1 -0.249483 -0.528534  1.672201 -1.307664
2  2.504183  0.659567 -1.050165 -1.206636
3  2.713183  0.030773       NaN -1.063719
4  0.885463  0.403601       NaN -1.242394

In [71]:
pd.concat([df1, df2])

          a         b         c         d
0 -0.381166  0.854895 -1.916495 -0.330340
1 -0.249483 -0.528534  1.672201 -1.307664
2  2.504183  0.659567 -1.050165 -1.206636
0  2.713183  0.030773       NaN -1.063719
1  0.885463  0.403601       NaN -1.242394

![concat.png](files/concat.png)

### 合并重叠数据

我们可能需要索引全部或者部分重叠的两个数据集

In [72]:
a = Series([np.nan, 2., np.nan, 3.5, 4.5, np.nan], index=list("fedcba"))

In [73]:
b = Series(np.arange(len(a), dtype=np.float64), index=list("fedcba"))

In [74]:
b[-1] = np.nan

In [75]:
a

f    NaN
e    2.0
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [76]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [77]:
np.where(pd.isnull(a), b, a)

array([ 0. ,  2. ,  2. ,  3.5,  4.5,  nan])

Series有一个combine_first的方法，会进行数据对齐

In [78]:
b[:-2].combine_first(a[2:])

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [79]:
b[:-2]

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [80]:
a[2:]

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

对于DataFrame，combine_first也会做同样的事情

In [81]:
df1 = DataFrame({
    "a": [1, np.nan, 5., np.nan],
    "b": [np.nan, 2., np.nan, 6.],
    "c": range(2, 18, 4)
})

In [82]:
df2 = DataFrame({
    "a": [5, 4, np.nan, 3, 7],
    "b": [np.nan, 3, 4, 6, 8]
})

In [83]:
df1.combine_first(df2)

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN